---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeEditor.Enable
source: html/792bbdb8-4629-7383-fbab-341df4b02341.htm
---
# Autodesk.Revit.DB.SlabShapeEditor.Enable Method

Enables the slab shape editing functionality.

## Syntax (C#)
```csharp
public void Enable()
```